from bs4 import BeautifulSoup as bs
import requests as re
import urllib.request as down

# input the category of memes you want
link = "https://moutamadris.ma/%d8%a7%d9%84%d8%aa%d8%a7%d8%b1%d9%8a%d8%ae-%d9%88-%d8%a7%d9%84%d8%ac%d8%ba%d8%b1%d8%a7%d9%81%d9%8a%d8%a7-%d8%a7%d9%88%d9%84%d9%89-%d8%a8%d8%a7%d9%83/"

# get link of web site with request as html file
memes_web_link = re.get(link)
html = memes_web_link.text

# convert the html file to <python objects>
datas = bs(html, "lxml")
# finding elements
data = datas.select("li p")
# using a for loop to find memes
items = []
for i in data:
    items.append(i.text)
print(items)

myList = ['مفهوم التنمية، تعدد المقاربات، التقسيمات الكبرى للعالم (خريطة التنمية)', 'المجال المغربي: الموارد الطبيعية والبشرية', 'الاختيارات الكبرى لسياسة إعداد التراب الوطني', 'التهيئة الحضرية والريفية: أزمة المدينة والريف وأشكال التدخل', 'العالم العربي: مشكل الماء وظاهرة التصحر', 'الولايات المتحدة الأمريكية قوة اقتصادية عظمى', 'الاتحاد الأوربي نحو اندماج شامل', 'الصين قوة اقتصادية صاعدة', 'ملف حول الشراكة بين المغرب والاتحاد الأوربي', 'التحولات الكبرى للعالم الرأسمالي وانعكاساتها خلال القرن 19م ومطلع القرن 20م', 'التحولات الاقتصادية والمالية والاجتماعية والفكرية في العالم في القرن 19م', 'التنافس الإمبريالي واندلاع الحرب العالمية الأولى', 'اليقظة الفكرية بالمشرق العربي', 'الضغوط الاستعمارية على المغرب ومحاولات الإصلاح', 'أوربا من نهاية الحرب العالمية الأولى إلى أزمة 1929م', 'الحرب العالمية الثانية (الأسباب والنتائج)', 'نظام الحماية بالمغرب والاستغلال الاستعماري', 'نضال المغرب من أجل تحقيق الاستقلال واستكمال الوحدة الترابية', 'العولمة والتحديات الراهنة', 'التطورات السياسية الكبرى بأوربا خلال القرن 19م', 'التحولات الاقتصادية والمالية المعززة للنظام الرأسمالي بأوربا خلال القرن 19م', 'التحولات الاجتماعية بأوربا وبروز الفكر الاشتراكي', 'بروز قوى رأسمالية جديدة خارج أوربا (الولايات المتحدة الأمريكية واليابان)', 'الظاهرة الإمبريالية في أواخر القرن 19م ومطلع القرن 20م', 'الاستغلال الإمبريالي للمستعمرات وانعكاساته الاقتصادية والاجتماعية (إفريقيا نموذجا)', 'التنافس الإمبريالي واندلاع الحرب العالمية الأولى',
          'الضغوط الأوربية على الإمبراطورية العثمانية ومحاولات الإصلاح', 'المحاولة المصرية لإقامة دولة مستقلة وحديثة وعوامل إجهاضها', 'اليقظة الفكرية بالمشرق العربي', 'الجزائر وتونس وليبيا في مواجهة الضغوط الاستعمارية والاحتلال', 'المغرب في مطلع القرن 19م (الضغوط الدولية وسياسة الاحتراز)', 'التغلغل الاستعماري في المغرب من 1830م إلى نهاية القرن 19م', 'محاولات الإصلاح في المغرب (مجالات الإصلاح ومحدوديتها)', 'اليقظة الفكرية في المشرق العربي', 'التنافس الاستعماري والسير نحو الحرب العالمية الأولى', 'المغرب في مطلع القرن 20م (الأوضاع الداخلية وفرض الحماية)', 'المغرب والعالم العربي (تقديم عام)', 'المجال المغربي: الموارد الطبيعية (التشخيص وأساليب التدبير)', 'المجال المغربي: الموارد البشرية (التشخيص ومستوى التنمية البشرية)', 'المجال المغربي: التقسيمات المجالية الكبرى', 'الاختيارات الكبرى لسياسة إعداد التراب الوطني', 'التهيئة الحضرية: أزمة المدينة وأشكال التدخل', 'التهيئة الريفية: أزمة الريف وأشكال التدخل', 'العالم العربي: مشكل الماء وظاهرة التصحر', 'العالم العربي: العلاقة بين المدن والأرياف (ترييف المدن)', 'ملف حول النقل الحضري، مثال (الدار البيضاء والقاهرة)', 'الصناعة النفطية وانعكاساتها على تنظيم المجال بالعالم العربي', 'السكان النشيطون والعمالة الأجنبية بالعالم العربي', 'واقع التبادل البيني العربي', 'قضايا التنمية البشرية', 'رهانات التكتلات الإقليمية (التكتل الإقليمي كخيار تنموي نموذجا المغرب العربي ومجلس التعاون الخليجي)', 'العالم العربي والبعد الجهوي (إفريقيا وأسيا)', 'العالم العربي وتحديات العولمة']

print(len(myList))



